Public Attributes | List of all members
API_KeyType Struct Reference
Old Listing
Description of a key. More...
#include <APIdefs_ListData.h>
 Public Attributes
 API_ListData_Head  | head
Contains the header information, including type, setIndex and index.
 char  | code [API_DBCodeLen]
Key code.
 char  | name [API_DBNameLen]
Name of the key.
Detailed Description
Description of a key.
Remarks
This structure is used when you get or search a key in the listing database. See the ACAPI_OldListing_Get and ACAPI_OldListing_Search functions.